In [1]:
import pandas as pd

Reading data from csv file

In [103]:
CustomerAddress = pd.read_csv('CustomerAddress1.csv')
Transactions = pd.read_csv('Transactions.csv')
NewCustomerList = pd.read_csv('NewCustomerList.csv')
CustomerDemographic = pd.read_csv('CustomerDemographic.csv')

# Monitoring Data

In [29]:
CustomerAddress.head()

,customer_id,address,postcode,state,country,property_valuation,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,1,060 Morning Avenue,2016,New South Wales,Australia,10,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,4,0 Holy Cross Court,4211,QLD,Australia,9,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,6,9 Oakridge Court,3216,VIC,Australia,9,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# There's Some null columns need to remove them

In [30]:
missing_value_count = CustomerAddress.isnull().sum()

In [31]:
missing_value_count

customer_id              0
address                  0
postcode                 0
state                    0
country                  0
property_valuation       0
Unnamed: 6            3999
Unnamed: 7            3999
Unnamed: 8            3999
Unnamed: 9            3999
Unnamed: 10           3999
Unnamed: 11           3999
Unnamed: 12           3999
Unnamed: 13           3999
Unnamed: 14           3999
Unnamed: 15           3999
Unnamed: 16           3999
Unnamed: 17           3999
Unnamed: 18           3999
Unnamed: 19           3999
Unnamed: 20           3999
Unnamed: 21           3999
Unnamed: 22           3999
Unnamed: 23           3999
Unnamed: 24           3999
Unnamed: 25           3999
dtype: int64

In [24]:
CustomerAddress.shape

(3999, 26)

In [35]:
CustAddress1 = CustomerAddress.dropna(axis=1)

In [36]:
CustAddress1

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9
...,...,...,...,...,...,...
3994,3999,1482 Hauk Trail,3064,VIC,Australia,3
3995,4000,57042 Village Green Point,4511,QLD,Australia,6
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10
3997,4002,8194 Lien Street,4032,QLD,Australia,7
3998,4003,320 Acker Drive,2251,NSW,Australia,7

In [37]:
CustAddress1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [38]:
#checking for duplicate values
CustAddress1.duplicated().sum()

0

There are no duplicate values check uniqueness of all columns

In [40]:
#check for uniqueness of each column
CustAddress1.nunique()

customer_id           3999
address               3996
postcode               873
state                    5
country                  1
property_valuation      12
dtype: int64

Exploring columns

In [41]:
CustAddress1['customer_id'].value_counts()

1       1
2676    1
2663    1
2664    1
2665    1
       ..
1343    1
1344    1
1345    1
1346    1
4003    1
Name: customer_id, Length: 3999, dtype: int64

In [42]:
CustAddress1['postcode'].value_counts()

2170    31
2155    30
2145    30
2153    29
3977    26
        ..
3808     1
3114     1
4721     1
4799     1
3089     1
Name: postcode, Length: 873, dtype: int64

In [43]:
CustAddress1['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [44]:
CustAddress1['property_valuation'].value_counts()

9     647
8     646
10    577
7     493
11    281
6     238
5     225
4     214
12    195
3     186
1     154
2     143
Name: property_valuation, dtype: int64

All the columns appear to have proper data

# Table 2:Transactions

In [45]:
Transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17
0,253,2.0,3123.0,12/30/17,False,Approved,Giant Bicycles,Road,low,small,590.26,$Â 525.33,40487.0,NaN,NaN,NaN,NaN,NaN
1,411,62.0,3355.0,12/30/17,False,Approved,Solex,Standard,medium,medium,478.16,$Â 298.72,34143.0,NaN,NaN,NaN,NaN,NaN
2,497,62.0,1854.0,12/30/17,True,Approved,Solex,Standard,high,medium,1024.66,$Â 614.80,34244.0,NaN,NaN,NaN,NaN,NaN
3,606,70.0,2878.0,12/30/17,False,Approved,Trek Bicycles,Standard,high,medium,495.72,$Â 297.43,36367.0,NaN,NaN,NaN,NaN,NaN
4,748,80.0,2865.0,12/30/17,True,Approved,Trek Bicycles,Standard,medium,large,1469.44,$Â 596.55,41047.0,NaN,NaN,NaN,NaN,NaN

In [46]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20001 entries, 0 to 20000
Data columns (total 18 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20001 non-null  object
 1   product_id               20000 non-null  float64
 2   customer_id              20000 non-null  float64
 3   transaction_date         20000 non-null  object
 4   online_order             19640 non-null  object
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  object
 12  product_first_sold_date  19803 non-null  float64
 13  Unnamed: 13              0 non-null      float64
 14  Unnamed: 14              0 non-null      float64
 15  Unnamed: 15              0 non-null      float64
 16  Unnamed: 16              0 non-null      float64
 17  Unnamed: 17              0 non-null      float64
dtypes: float64(9), object(9)
memory usage: 2.7+ MB

In [47]:
Transactions.shape

(20001, 18)

In [50]:
missing_value_count = Transactions.isnull().sum()

In [51]:
missing_value_count

transaction_id                 0
product_id                     1
customer_id                    1
transaction_date               1
online_order                 361
order_status                   1
brand                        198
product_line                 198
product_class                198
product_size                 198
list_price                     1
standard_cost                198
product_first_sold_date      198
Unnamed: 13                20001
Unnamed: 14                20001
Unnamed: 15                20001
Unnamed: 16                20001
Unnamed: 17                20001
dtype: int64

In [52]:
#Using only the required columns 
Transactions = Transactions.iloc[:, 0:13]
Transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,253,2.0,3123.0,12/30/17,False,Approved,Giant Bicycles,Road,low,small,590.26,$Â 525.33,40487.0
1,411,62.0,3355.0,12/30/17,False,Approved,Solex,Standard,medium,medium,478.16,$Â 298.72,34143.0
2,497,62.0,1854.0,12/30/17,True,Approved,Solex,Standard,high,medium,1024.66,$Â 614.80,34244.0
3,606,70.0,2878.0,12/30/17,False,Approved,Trek Bicycles,Standard,high,medium,495.72,$Â 297.43,36367.0
4,748,80.0,2865.0,12/30/17,True,Approved,Trek Bicycles,Standard,medium,large,1469.44,$Â 596.55,41047.0

In [53]:
missing_value_count = Transactions.isnull().sum()

In [54]:
missing_value_count

transaction_id               0
product_id                   1
customer_id                  1
transaction_date             1
online_order               361
order_status                 1
brand                      198
product_line               198
product_class              198
product_size               198
list_price                   1
standard_cost              198
product_first_sold_date    198
dtype: int64

In [ ]:
#There are missing values in 12 columns

Check for duplicate values and uniqueness

In [55]:
Transactions.duplicated().sum()

0

In [ ]:
# There are 0 duplicate values

In [56]:
Transactions.nunique()

transaction_id             20001
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

Check data from each column

In [57]:
Transactions['online_order'].value_counts()

True     9829
False    9811
Name: online_order, dtype: int64

In [59]:
Transactions['product_id'].value_counts()

0.0      1378
3.0       354
1.0       311
35.0      268
38.0      267
         ...
71.0      137
16.0      136
8.0       136
100.0     130
47.0      121
Name: product_id, Length: 101, dtype: int64

In [60]:
Transactions['transaction_date'].value_counts()

8/18/17     82
2/14/17     82
10/15/17    76
1/31/17     73
12/19/17    71
            ..
8/29/17     38
12/7/17     37
3/29/17     36
9/25/17     35
10/19/17    32
Name: transaction_date, Length: 364, dtype: int64

In [61]:
Transactions['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [62]:
 Transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [63]:
 Transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [64]:
 Transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [65]:
 Transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

In [66]:
Transactions['product_first_sold_date'].value_counts()

33879.0    234
41064.0    229
37823.0    227
39880.0    222
38216.0    220
          ...
41848.0    169
42404.0    168
41922.0    166
37659.0    163
34586.0    162
Name: product_first_sold_date, Length: 100, dtype: int64

In [ ]:
# need to convert  product sold date column in to date type

In [67]:
#convert date column from integer to datetime
Transactions['product_first_sold_date'] = pd.to_datetime(Transactions['product_first_sold_date'], unit='s')
Transactions['product_first_sold_date'].head()

0   1970-01-01 11:14:47
1   1970-01-01 09:29:03
2   1970-01-01 09:30:44
3   1970-01-01 10:06:07
4   1970-01-01 11:24:07
Name: product_first_sold_date, dtype: datetime64[ns]

In [69]:
Transactions['product_first_sold_date'].head(20)

0    1970-01-01 11:14:47
1    1970-01-01 09:29:03
2    1970-01-01 09:30:44
3    1970-01-01 10:06:07
4    1970-01-01 11:24:07
5    1970-01-01 09:55:07
6    1970-01-01 09:14:19
7    1970-01-01 11:11:43
8    1970-01-01 11:47:38
9    1970-01-01 10:41:22
10   1970-01-01 09:35:27
11   1970-01-01 10:47:39
12   1970-01-01 09:50:55
13   1970-01-01 10:36:33
14   1970-01-01 10:13:53
15   1970-01-01 11:44:55
16   1970-01-01 10:06:07
17   1970-01-01 09:28:35
18   1970-01-01 09:14:19
19   1970-01-01 11:26:07
Name: product_first_sold_date, dtype: datetime64[ns]

In [ ]:
# here date is same and different time, Incorrect data in product sold column

# Table 3: New Customer List Data Set

In [70]:
NewCustomerList.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Giulietta,Garbott,Female,59.0,2002-02-27,Technical Writer,NaN,Affluent Customer,N,Yes,...,VIC,Australia,5.0,1.09,1.3625,1.3625,1.362500,NaN,355.0,0.984375
1,Lura,Fawdrie,Female,66.0,2002-01-17,VP Sales,Health,Mass Customer,N,Yes,...,QLD,Australia,3.0,0.41,0.5125,0.5125,0.435625,NaN,396.0,0.937500
2,Simmonds,Bapty,Male,52.0,2002-01-04,Junior Executive,Financial Services,Affluent Customer,N,No,...,NSW,Australia,12.0,0.55,0.5500,0.6875,0.687500,NaN,760.0,0.637500
3,Tomkin,Bernlin,Male,7.0,2001-12-29,Food Chemist,Health,Affluent Customer,N,Yes,...,NSW,Australia,3.0,0.50,0.6250,0.6250,0.625000,NaN,475.0,0.881875
4,Burk,Wortley,Male,22.0,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,...,NSW,Australia,10.0,0.80,0.8000,1.0000,0.850000,NaN,997.0,0.357000

In [71]:
NewCustomerList.shape

(1001, 23)

In [72]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1001 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   float64
 4   DOB                                  983 non-null    object
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   float64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   float64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   float64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          0 non-null      float64
 21  Rank                                 1000 non-null   float64
 22  Value                                1000 non-null   float64
dtypes: float64(11), object(12)
memory usage: 180.0+ KB

In [76]:
#Dropping the unnamed columns
NewCustomerList.drop(['Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20'], axis=1, inplace=True)

In [78]:
NewCustomerList.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Giulietta,Garbott,Female,59.0,2002-02-27,Technical Writer,NaN,Affluent Customer,N,Yes,14.0,48297 Stuart Circle,3810.0,VIC,Australia,5.0,355.0,0.984375
1,Lura,Fawdrie,Female,66.0,2002-01-17,VP Sales,Health,Mass Customer,N,Yes,4.0,67183 Anniversary Parkway,4211.0,QLD,Australia,3.0,396.0,0.937500
2,Simmonds,Bapty,Male,52.0,2002-01-04,Junior Executive,Financial Services,Affluent Customer,N,No,8.0,47 Susan Park,2025.0,NSW,Australia,12.0,760.0,0.637500
3,Tomkin,Bernlin,Male,7.0,2001-12-29,Food Chemist,Health,Affluent Customer,N,Yes,9.0,0492 Kings Street,2480.0,NSW,Australia,3.0,475.0,0.881875
4,Burk,Wortley,Male,22.0,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6.0,04 Union Crossing,2196.0,NSW,Australia,10.0,997.0,0.357000

Check for missing values

In [79]:
NewCustomerList.isnull().sum()

first_name                               0
last_name                               30
gender                                   1
past_3_years_bike_related_purchases      1
DOB                                     18
job_title                              107
job_industry_category                  166
wealth_segment                           1
deceased_indicator                       1
owns_car                                 1
tenure                                   1
address                                  1
postcode                                 1
state                                    1
country                                  1
property_valuation                       1
Rank                                     1
Value                                    1
dtype: int64

In [80]:
NewCustomerList.shape

(1001, 18)

In [ ]:
# There are 2 columns which has more than 100 missing values and 17 column has atleast 1 missing value

Checking duplicate and unique values

In [82]:
NewCustomerList.duplicated().sum()

0

In [ ]:
#There are 0 duplicate values

In [83]:
NewCustomerList.nunique()

first_name                              941
last_name                               961
gender                                    3
past_3_years_bike_related_purchases     100
DOB                                     958
job_title                               184
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        1
owns_car                                  2
tenure                                   23
address                                1000
postcode                                522
state                                     3
country                                   1
property_valuation                       12
Rank                                    324
Value                                   319
dtype: int64

Exploring all columns

In [85]:
NewCustomerList['first_name'].value_counts()

Rozamond                                                                                                                                                                         3
Dorian                                                                                                                                                                           3
Mandie                                                                                                                                                                           3
Aloysius                                                                                                                                                                         2
Anthony                                                                                                                                                                          2
                                                                                                                                                                                ..
Carita                                                                                                                                                                           1
Artemis                                                                                                                                                                          1
Matias                                                                                                                                                                           1
Manny                                                                                                                                                                            1
Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.     1
Name: first_name, Length: 941, dtype: int64

In [86]:
NewCustomerList['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [ ]:
# here U field is incorrect and unknown

In [87]:
NewCustomerList['past_3_years_bike_related_purchases'].value_counts()

60.0    20
59.0    18
42.0    17
70.0    17
11.0    16
        ..
92.0     5
9.0      5
19.0     5
85.0     4
20.0     3
Name: past_3_years_bike_related_purchases, Length: 100, dtype: int64

In [88]:
NewCustomerList['DOB'].value_counts()

1951-04-29    2
1992-10-13    2
1959-09-18    2
1987-01-15    2
1959-08-01    2
             ..
1977-04-08    1
1977-03-20    1
1977-02-12    1
1977-02-03    1
1973-03-15    1
Name: DOB, Length: 958, dtype: int64

In [90]:
NewCustomerList['DOB'].value_counts()

1951-04-29    2
1992-10-13    2
1959-09-18    2
1987-01-15    2
1959-08-01    2
             ..
1977-04-08    1
1977-03-20    1
1977-02-12    1
1977-02-03    1
1973-03-15    1
Name: DOB, Length: 958, dtype: int64

In [91]:
NewCustomerList['job_title'].value_counts()

Associate Professor            15
Environmental Tech             14
Software Consultant            14
Chief Design Engineer          13
Assistant Media Planner        12
                               ..
Programmer Analyst IV           1
Staff Accountant III            1
Computer Systems Analyst IV     1
Staff Accountant II             1
Database Administrator I        1
Name: job_title, Length: 184, dtype: int64

In [92]:
NewCustomerList['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [93]:
NewCustomerList['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [94]:
NewCustomerList['deceased_indicator'].value_counts()

N    1000
Name: deceased_indicator, dtype: int64

In [95]:
NewCustomerList['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [96]:
NewCustomerList['tenure'].value_counts()

9.0     79
13.0    74
11.0    68
10.0    63
12.0    61
5.0     60
7.0     60
17.0    59
15.0    58
8.0     55
14.0    54
16.0    49
6.0     45
4.0     36
18.0    36
19.0    34
3.0     26
21.0    24
20.0    22
2.0     15
22.0    12
1.0      8
0.0      2
Name: tenure, dtype: int64

In [97]:
NewCustomerList['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [98]:
NewCustomerList['property_valuation'].value_counts()

9.0     173
8.0     162
7.0     138
10.0    116
6.0      70
11.0     62
5.0      57
4.0      53
3.0      51
12.0     46
2.0      42
1.0      30
Name: property_valuation, dtype: int64

In [99]:
NewCustomerList['Rank'].value_counts()

760.0    13
259.0    12
904.0     9
455.0     9
386.0     9
         ..
603.0     1
882.0     1
993.0     1
870.0     1
84.0      1
Name: Rank, Length: 324, dtype: int64

# Table 4: CustomerDemographic

In [111]:
CustomerDemographic = pd.read_csv('CustomerDemographic.csv')

In [112]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,...,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [113]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 25 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   object
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
 13  Unnamed: 13                          0 non-null      float64
 14  Unnamed: 14                          0 non-null      float64
 15  Unnamed: 15                          0 non-null      float64
 16  Unnamed: 16                          0 non-null      float64
 17  Unnamed: 17                          0 non-null      float64
 18  Unnamed: 18                          0 non-null      float64
 19  Unnamed: 19                          0 non-null      float64
 20  Unnamed: 20                          0 non-null      float64
 21  Unnamed: 21                          0 non-null      float64
 22  Unnamed: 22                          0 non-null      float64
 23  Unnamed: 23                          0 non-null      float64
 24  Unnamed: 24                          0 non-null      float64
dtypes: float64(13), int64(2), object(10)
memory usage: 781.4+ KB

In [ ]:
# remove unnamed columns

In [ ]:
CustomerDemographic.drop(['Unnamed: 13','Unnamed: 14',
                          'Unnamed: 15','Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20',
                          'Unnamed: 21','Unnamed: 22','Unnamed: 23','Unnamed: 24'], axis=1, inplace=True)

In [120]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 14 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   object
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
 13  Unnamed: 24                          0 non-null      float64
dtypes: float64(2), int64(2), object(10)
memory usage: 437.6+ KB

In [122]:
CustomerDemographic.drop(['Unnamed: 24'], axis=1, inplace=True)

In [123]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   object
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 406.4+ KB

Checking null values

In [124]:
CustomerDemographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [ ]:
# 2 columns has more than 500 null columns and total 6 column has null values

Checking duplicate and unique values

In [125]:
CustomerDemographic.duplicated().sum()

0

In [ ]:
# there are 0 duplicated values

In [126]:
CustomerDemographic.nunique()

customer_id                            4000
first_name                             3139
last_name                              3725
gender                                    6
past_3_years_bike_related_purchases     100
DOB                                    3448
job_title                               195
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        2
default                                 101
owns_car                                  2
tenure                                   22
dtype: int64

Exploring all columns

In [128]:
CustomerDemographic.shape

(4000, 13)

In [129]:
CustomerDemographic['first_name'].value_counts()

Max         5
Tobe        5
Timmie      5
Kippy       4
Pail        4
           ..
Katy        1
Hakim       1
Fanchon     1
Jeanette    1
Sarene      1
Name: first_name, Length: 3139, dtype: int64

In [130]:
CustomerDemographic['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [ ]:
# here gender value is duplicated and incorrectly filled

In [131]:
#Re-naming the categories
CustomerDemographic['gender'] = CustomerDemographic['gender'].replace('F','Female').replace('M','Male').replace('Femal','Female').replace('U','Unspecified')

In [132]:
CustomerDemographic['gender'].value_counts()

Female         2039
Male           1873
Unspecified      88
Name: gender, dtype: int64

In [133]:
CustomerDemographic['default'].value_counts()

1.00E+02     111
-1.00E+02     96
1             70
-1            64
Ã¢Â°Ã¢Â´Ã¢ÂµÃ¢Ã¢Ã¢     53
            ...
-5.00E-01      2
$Â 100.00       2
0.00E+00       2
$Â 0.00         1
-$Â 0.50        1
Name: default, Length: 101, dtype: int64

In [ ]:
# incorrect values hence dropping column

In [138]:
CustomerDemographic.drop(['default'],axis=1,inplace=True)

In [139]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [140]:
CustomerDemographic['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64